export interface Story {
  id: number;
  year: number;
  text: string;
}

export interface Topic {
  id: number;
  title: string;
  stories: Story[];
}

export const mockTopics: Topic[] = [
  {
    id: 1,
    title: "История технологий",
    stories: [
      { id: 1, year: 1991, text: "Появление World Wide Web" },
      { id: 2, year: 2007, text: "Запуск первого iPhone" },
      { id: 3, year: 2010, text: "Рост популярности облачных сервисов" },
      {
        id: 4,
        year: 2015,
        text: "Расширение использования искусственного интеллекта",
      },
      { id: 5, year: 2023, text: "Массовое внедрение ChatGPT" },
    ],
  },
  {
    id: 2,
    title: "Мировые события",
    stories: [
      { id: 6, year: 1989, text: "Падение Берлинской стены" },
      { id: 7, year: 2001, text: "Теракты 11 сентября в США" },
      { id: 8, year: 2008, text: "Мировой финансовый кризис" },
      { id: 9, year: 2020, text: "Пандемия COVID-19" },
      { id: 10, year: 2022, text: "Глобальные геополитические перемены" },
    ],
  },
  {
    id: 3,
    title: "Кино и медиа",
    stories: [
      { id: 11, year: 1997, text: "Выход 'Титаника'" },
      { id: 12, year: 2009, text: "Премьера 'Аватара'" },
      { id: 13, year: 2011, text: "Финал 'Гарри Поттера'" },
      { id: 14, year: 2019, text: "Рекорд 'Мстителей: Финал'" },
      { id: 15, year: 2021, text: "Расцвет стриминговых сервисов" },
    ],
  },
  {
    id: 4,
    title: "Спорт",
    stories: [
      { id: 16, year: 1998, text: "Франция выигрывает ЧМ по футболу" },
      { id: 17, year: 2008, text: "Олимпийские игры в Пекине" },
      { id: 18, year: 2016, text: "ОИ в Рио-де-Жанейро" },
      { id: 19, year: 2018, text: "Россия проводит ЧМ по футболу" },
      { id: 20, year: 2022, text: "Зимняя Олимпиада в Пекине" },
    ],
  },
  {
    id: 5,
    title: "Музыка и культура",
    stories: [
      { id: 21, year: 1985, text: "Концерт Live Aid" },
      { id: 22, year: 2000, text: "Расцвет поп-культуры 2000-х" },
      { id: 23, year: 2016, text: "Смерть Дэвида Боуи" },
      { id: 24, year: 2020, text: "TikTok становится мейнстримом" },
      { id: 25, year: 2023, text: "AI-музыка набирает популярность" },
    ],
  },
  {
    id: 6,
    title: "Наука и открытия",
    stories: [
      { id: 26, year: 2003, text: "Завершение проекта 'Геном человека'" },
      { id: 27, year: 2012, text: "Открытие бозона Хиггса" },
      { id: 28, year: 2015, text: "Подтверждение гравитационных волн" },
      { id: 29, year: 2021, text: "Запуск телескопа Джеймса Уэбба" },
      { id: 30, year: 2024, text: "Прорыв в термоядерном синтезе" },
    ],
  },
];
